In [1]:
import pandas as pd
d={'name':['Kavi Gupta','mahi Jain','ravi bansal','savi chopra','navi jindal'],'code':['23D','41','26E','44 A','12'],'attempts':[2,1,3,1,2],'qualify':['yes','no','no','yes','yes']}

df=pd.DataFrame(d)
df

In [2]:
#remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series.
fruits=pd.Index(['banana',' orange','papaya ',' grapes '])
fruits

fruits.str.strip()
fruits.str.lstrip()
fruits.str.rstrip()

In [3]:
#capitalize all the string values of specified columns of a given DataFrame.
df['name']=list(map(lambda x:x.upper(),df['name']))
df

In [4]:
#count of occurrence of a specified substring in a DataFrame column.
df['qualify'].apply(lambda x: x.count('e'))

0    1
1    0
2    0
3    1
4    1
Name: qualify, dtype: int64

In [5]:
#check whether only numeric values present in a given column of a DataFrame.
list(map(lambda x:x.isdigit(),df['code']))

[False, True, False, False, True]

In [6]:
#check whether only lower case, upper case or title case is present in a given column of a DataFrame.
list(map(lambda x:x.isupper(),df['name']))
list(map(lambda x:x.islower(),df['name']))
list(map(lambda x:x.istitle(),df['name']))

[False, False, False, False, False]

In [7]:
#get the length of the string present of a given column in a DataFrame.
df['code'].str.len()

0    3
1    2
2    3
3    4
4    2
Name: code, dtype: int64

In [8]:
#get the length of the integer of a given column in a DataFrame.
df['attempts'].map(str).apply(len)

0    1
1    1
2    1
3    1
4    1
Name: attempts, dtype: int64

In [9]:
#check if a specified column starts with a specified string in a DataFrame.
list(map(lambda x:x.startswith('K'),df['name']))

[True, False, False, False, False]

In [10]:
#convert a specified character column in upper/lower/title cases in a given DataFrame.
list(map(lambda x: x.upper(),df['name']))
list(map(lambda x: x.lower(),df['name']))
list(map(lambda x: x.title(),df['name']))

['Kavi Gupta', 'Mahi Jain', 'Ravi Bansal', 'Savi Chopra', 'Navi Jindal']

In [11]:
#replace arbitrary values with other values in a given DataFrame.
df['name'].replace('KAVI','Tavi')

0     KAVI GUPTA
1      MAHI JAIN
2    RAVI BANSAL
3    SAVI CHOPRA
4    NAVI JINDAL
Name: name, dtype: object

In [12]:
#replace more than one value with other values in a given DataFrame.
df['name'].replace(['KAVI','MAHI'],['ZAVI','GAVI'])

0     KAVI GUPTA
1      MAHI JAIN
2    RAVI BANSAL
3    SAVI CHOPRA
4    NAVI JINDAL
Name: name, dtype: object

In [13]:
#split a string of a column of a given DataFrame into multiple columns.
df[['first_name','last_name']]=df['name'].str.split(" ", expand=True)
df.drop(['name'], axis=1)

   code  attempts qualify first_name last_name
0   23D         2     yes       KAVI     GUPTA
1    41         1      no       MAHI      JAIN
2   26E         3      no       RAVI    BANSAL
3  44 A         1     yes       SAVI    CHOPRA
4    12         2     yes       NAVI    JINDAL